{
  "Vivlio": [
    {
      "id": "1",
      "image": "vivlio/menuPrincipal.png",
      "text": "Na página inicial, os livros são organizados de forma intuitiva, permitindo que o usuário navegue por categorias literárias ou por seleções voltadas a faculdades específicas. A proposta é oferecer uma ampla variedade de títulos, garantindo ao leitor um leque diversificado de opções logo no primeiro acesso."
    },
    {
      "id": "2",
      "image": "vivlio/carousels.png",
      "text": "Essa imagem complementa a anterior, exibindo uma continuação dos carrosséis de livros disponíveis na tela inicial. Além do carrossel 'USP 2024' presente na primeira imagem, aqui vemos também o carrossel 'UFPR 2024', ampliando a curadoria de obras direcionadas a diferentes vestibulares e instituições. Essa organização facilita ao usuário encontrar livros alinhados aos seus objetivos acadêmicos."
    },
    {
      "id": "3",
      "image": "vivlio/livro.png",
      "text": "Ao selecionar um livro, o usuário é direcionado a esta página dedicada, onde pode acessar recursos como leitura online, download, marcação como favorito e resolução de questões relacionadas à obra. Essa tela centraliza as principais ações de interação com o conteúdo escolhido."
    },
    {
      "id": "4",
      "image": "vivlio/perfilAutor.png",
      "text": "Na página do autor, o usuário tem a oportunidade de conhecer mais sobre a trajetória e estilo do escritor, além de visualizar todas as suas obras disponíveis na plataforma. É possível também favoritar autores, criando uma experiência personalizada de leitura."
    }
  ],
  "Weather App": [
    {
      "id": "1",
      "image": "weatherApp/telaInicial.png",
      "text": "Tela inicial do aplicativo de previsão do tempo exibindo informações meteorológicas para São Paulo. Mostra a condição climática atual (nuvens encobertas), temperatura, umidade, vento e previsão para os próximos quatro dias. O layout utiliza um tema claro com um gradiente de fundo colorido e ícones representando o clima de cada dia."
    },
    {
      "id": "2",
      "image": "weatherApp/darkMode.png",
      "text": "Versão em modo escuro do aplicativo de previsão do tempo, mostrando os dados meteorológicos de Los Angeles. A interface apresenta temperatura atual, velocidade do vento, umidade, cobertura de nuvens e a previsão para os próximos dias. O design adota tons escuros e elementos visuais adaptados ao tema noturno, mantendo os ícones de clima e os dados organizados em cartões."
    }
  ],
  "Todo List": [
    {
      "id": "1",
      "image":"todoList/telaInicial.png",
      "text": "Este é o início da minha aplicação Todo List, com uma interface simples, intuitiva e responsiva. Pensada para facilitar o gerenciamento de tarefas, a tela inicial permite adicionar novos itens de forma rápida e prática."
    },
    {
      "id": "2",
      "image":"todoList/tarefasCadastradas.png",
      "text": "A interface exibe as tarefas cadastradas com botões para marcar como concluída, editar ou excluir. O visual limpo e a fluidez nas interações demonstram atenção ao usuário e aplicação de boas práticas no desenvolvimento web."
    }
  ],
  "Próximo Projeto": [
    {
      "id": "1",
      "image": "futureProject/img1.png",
      "text": "Descrição da imagem 1"
    },
    {
      "id": "2",
      "image": "futureProject/img2.png",
      "text": "Descrição da imagem 2"
    },
    {
      "id": "3",
      "image": "futureProject/img3.png",
      "text": "Descrição da imagem 3"
    }
  ]
}