[
    {
        "role": "Tecnólogo em Análise e Desenvolvimento de Sistemas",
        "organisation": "SENAC SP",
        "startDate": "Fev, 2024",
        "endDate": "Present",
        "description": "I am currently pursuing a degree in technology, focusing on systems development and computer science fundamentals.\n In the first semester, I studied subjects such as Research and Society, IT Infrastructure, Fundamentals of Administration, Computational Concepts, and Algorithms and Programming. These disciplines helped me build a strong foundation in logic, organizational structure, and scientific thinking.\n In the second semester, I deepened my knowledge in Algorithms and Programming II, learning about data structures and code modularization. In Systems Analysis, I studied requirements gathering and software modeling. I also learned how to structure and query relational databases using SQL, gained a better understanding of computer architecture in Computer Science II, and broadened my ethical and social perspective through the Ethics, Citizenship, and Sustainability course.\n This semester, I am focusing on Software Engineering and Object-Oriented Programming (OOP). In Software Engineering, I am studying the complete system development process, from requirements definition and system modeling to validation and testing methods. I am also learning about software process models such as Waterfall, Iterative, and Agile.\n In OOP, I am learning to apply concepts like classes, objects, encapsulation, inheritance, and polymorphism, which are essential for building organized, reusable, and maintainable software. I am also practicing building applications with an object-oriented design approach using languages like C#.",
        "imageSrc": "education/senac.png"
    },
    {
        "role": "Técnico em Desenvolvimento de Sistemas",
        "organisation": "ETEC - Albert Einstein",
        "startDate": "Fev, 2022",
        "endDate": "Jun, 2023",
        "description": "In this technical course, we analyze, design, and develop our own websites, mobile applications, and software for computers and smartphones. We work through the entire development cycle—from planning and prototyping to implementation and testing—using a diverse set of technologies and tools.\n Our practical training includes programming in C#, front-end development with HTML, CSS, and JavaScript, and back-end scripting with PHP. We also explore modern frameworks and libraries such as Angular and Ionic for creating dynamic web and mobile apps. Additionally, we manage data using relational databases like SQL, and NoSQL databases such as MongoDB and Firebase, gaining experience in both traditional and cloud-based database management.\n This hands-on approach allows us to understand how different technologies integrate to build complete, efficient, and scalable solutions, preparing us for real-world challenges in software development.",
        "imageSrc": "education/etec.svg"
    }
]